<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html lang=&quot;en-US">
<head>
<!-- GenHTML revision 23224-->
  <meta http-equiv="Content-type" content="text/html; charset=utf-8">
  <title>Document Information - Java Card 3 Development
  </title>
</title></head>
<body class="HlpBdy">
<a name="documentinfo"></a><p></p><p>December 2009, Revision 01</p><p>Copyright 2009  Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, California 95054, U.S.A. All rights reserved.</p><p>Online
help for the Java Card 3 plugin.</p><p>Sun Microsystems, Inc. has intellectual property rights
relating to technology embodied in the product that is described in this document.
In particular, and without limitation, these intellectual property rights may include one or
more of the U.S. patents listed at http://www.sun.com/patents and one or more additional
patents or pending patent applications in the U.S. and in other countries.</p><p>U.S. Government
Rights - Commercial Software. Government users are subject to the Sun Microsystems, Inc.
standard license agreement and applicable provisions of the FAR and its supplements.</p><p>Sun, Sun
Microsystems, the Sun logo, Java, Solaris, Java Card, Java Developer Connection, Mozilla, Netscape,
Javadoc, JAR, JDK, JVM, and NetBeans are trademarks or registered trademarks of Sun Microsystems,
Inc. or its subsidiaries, in the U.S. and other countries UNIX is a registered
trademark in the U.S. and other countries, exclusively licensed through X/Open Company, Ltd.</p><p>Products
covered by and information contained in this service manual are controlled by U.S.
Export Control laws and may be subject to the export or import laws
in other countries. Nuclear, missile, chemical biological weapons or nuclear maritime end uses
or end users, whether direct or indirect, are strictly prohibited. Export or reexport to
countries subject to U.S. embargo or to entities identified on U.S. export exclusion
lists, including, but not limited to, the denied persons and specially designated nationals
lists is strictly prohibited.</p><p>DOCUMENTATION IS PROVIDED &quot;AS IS&quot; AND ALL EXPRESS OR IMPLIED CONDITIONS,
REPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
PURPOSE OR NON-INFRINGEMENT, ARE DISCLAIMED, EXCEPT TO THE EXTENT THAT SUCH DISCLAIMERS ARE HELD
TO BE LEGALLY INVALID.</p><p></p><p>Copyright &#169; 2009 Sun Microsystems, Inc., 4150 Network Circle, Santa
Clara, California 95054, &#201;tats-Unis. Tous droits r&#233;serv&#233;s.</p><p>Sun Microsystems, Inc. d&#233;tient les droits de
propri&#233;t&#233; intellectuelle relatifs &#224; la technologie incorpor&#233;e dans le produit qui est d&#233;crit dans
ce document. En particulier, et ce sans limitation, ces droits de propri&#233;t&#233; intellectuelle peuvent
inclure un ou plusieurs des brevets am&#233;ricains list&#233;s &#224; l&#39;adresse suivante: http://www.sun.com/patents et un
ou plusieurs brevets suppl&#233;mentaires ou les applications de brevet en attente aux &#201;tats
- Unis et dans les autres pays.</p><p>Droits du gouvernement des  &#201;tats-Unis -
Logiciel Commercial. Les droits des utilisateur du gouvernement des &#201;tats-Unis sont soumis aux termes
de la licence standard Sun Microsystems et aux conditions appliqu&#233;es de la FAR
et de ces compl&#233;ments.</p><p>Sun, Sun Microsystems, le logo Sun, Java, Solaris, Java
Card, Java Developer Connection, Mozilla, Netscape, Javadoc, JAR, JDK, JVM, et NetBeans sont des
marques de fabrique ou des marques d&#233;pos&#233;es enregistr&#233;es de Sun Microsystems, Inc. ou
ses filiales, aux &#201;tats-Unis et dans d&#39;autres pays.</p><p>UNIX est une marque d&#233;pos&#233;e aux
&#201;tats-Unis et dans d&#39;autres pays et licenci&#233;e exlusivement par X/Open Company, Ltd.</p><p>Les produits qui
font l&#39;objet de ce manuel d&#39;entretien et les informations qu&#39;il contient sont regis
par la legislation americaine en mati&#232;re de contr&#244;le des exportations et peuvent &#234;tre soumis
au droit d&#39;autres pays dans le domaine des exportations et importations. Les utilisations
finales, ou utilisateurs finaux, pour des armes nucleaires, des missiles, des armes biologiques
et chimiques ou du nucleaire maritime, directement ou indirectement, sont strictement interdites. Les exportations
ou reexportations vers des pays sous embargo des &#201;tats-Unis, ou vers des entites figurant
sur les listes d&#39;exclusion d&#39;exportation americaines, y compris, mais de maniere non exclusive,
la liste de personnes qui font objet d&#39;un ordre de ne pas participer,
d&#39;une fa&#231;on directe ou indirecte, aux exportations de des produits ou des services qui
sont regi par la legislation americaine   sur le contr&#244;le des exportations
et la liste de ressortissants specifiquement designes, sont rigoureusement interdites.</p><p>LA DOCUMENTATION EST FOURNIE
&quot;EN L&#39;&#201;TAT&quot; ET TOUTES AUTRES CONDITIONS, DECLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT
EXCLUES, DANS LA MESURE AUTORISEE PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT TOUTE
GARANTIE IMPLICITE RELATIVE &#192;LA QUALITE MARCHANDE, &#192; L&#39;APTITUDE &#192; UNE UTILISATION PARTICULIERE OU &#192;
L&#39;ABSENCE DE CONTREFA&#199;ON.</p>
<br/>
</body>
</html>
