ProblemsPanel.lblDescription.text=\u8aac\u660e\:

ERR_Project_validation.=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u30e2\u30c7\u30eb\u306e\u59a5\u5f53\u6027\u691c\u67fb\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002

ERR_SystemScope=\u300c\u30b7\u30b9\u30c6\u30e0\u300d\u304c\u30b9\u30b3\u30fc\u30d7\u306e\u4f9d\u5b58\u6027\u306f\u691c\u51fa\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b3\u30fc\u30c9\u88dc\u5b8c\u304c\u5f71\u97ff\u3092\u53d7\u3051\u307e\u3059\u3002 

MSG_SystemScope=\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u5185\u306b\u300c\u30b7\u30b9\u30c6\u30e0\u300d\u304c\u30b9\u30b3\u30fc\u30d7\u3057\u305f\u4f9d\u5b58\u6027\u304c\u3042\u308a\u307e\u3059\u304c\u3001\u30d0\u30a4\u30ca\u30ea\u3078\u306e\u30d1\u30b9\u304c\u6709\u52b9\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002\n\u30d1\u30b9\u304c\u7d76\u5bfe\u30d1\u30b9\u3067\u3001\u65e2\u5b58\u306e\u30d0\u30a4\u30ca\u30ea\u3092\u793a\u3057\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ERR_NonLocal=\u4e00\u90e8\u306e\u4f9d\u5b58\u6027\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u306f\u3001\u30ed\u30fc\u30ab\u30eb\u30ea\u30dd\u30b8\u30c8\u30ea\u306b\u306f\u3042\u308a\u307e\u305b\u3093\u3002

MSG_NonLocal=\u30ed\u30fc\u30ab\u30eb\u3067\u89e3\u6c7a\u3055\u308c\u3066\u3044\u306a\u3044\u4f9d\u5b58\u6027\u304c\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b\u3042\u308a\u307e\u3059\u3002IDE \u306e\u30b3\u30fc\u30c9\u88dc\u5b8c\u306f\u3001\u3053\u308c\u3089\u306e\u4f9d\u5b58\u6027\u304b\u3089\u306e\u30af\u30e9\u30b9\u3092\u542b\u307f\u307e\u305b\u3093\u3002\n\u307e\u305f\u3001\u305d\u308c\u3089\u306e\u63a8\u79fb\u7684\u306a\u4f9d\u5b58\u6027\u306b\u3082 (\u958b\u3044\u3066\u3044\u308b\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u5185\u306b\u306a\u3044\u9650\u308a) \u542b\u307e\u308c\u307e\u305b\u3093\u3002\n \u4f9d\u5b58\u6027\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3059\u308b\u304b\u3001\u30ea\u30e2\u30fc\u30c8\u3067\u4f7f\u7528\u53ef\u80fd\u3067\u306a\u3044\u5834\u5408\u306f\u3001\u624b\u52d5\u3067\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u30a2\u30fc\u30c6\u30a3\u30d5\u30a1\u30af\u30c8\u306f\u6b21\u306e\u3068\u304a\u308a\u3067\u3059\:\n {0}

ERR_NoParent=\u89aa POM \u30d5\u30a1\u30a4\u30eb\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u8a2d\u5b9a\u304c\u6b63\u3057\u304f\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002

MSG_NoParent=ID {0} \u306e\u89aa POM \u304c\u3001\u30bd\u30fc\u30b9\u307e\u305f\u306f\u30ed\u30fc\u30ab\u30eb\u30ea\u30dd\u30b8\u30c8\u30ea\u3067\u691c\u51fa\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002<relativePath> \u30bf\u30b0\u304c\u6b63\u3057\u304f\u3001\u5b9f\u5728\u3057\u3066\u3044\u308b\u304b\u3001\u30bd\u30fc\u30b9\u306e\u89aa POM \u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30d0\u30fc\u30b8\u30e7\u30f3\u3068\u4e00\u81f4\u3057\u3066\u3044\u308b\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\u30ea\u30e2\u30fc\u30c8\u30ea\u30dd\u30b8\u30c8\u30ea\u3092\u4ecb\u3057\u3066\u306e\u307f\u89aa\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u5834\u5408\u3001\u305d\u308c\u3092\u53ce\u5bb9\u3059\u308b\u30ea\u30dd\u30b8\u30c8\u30ea\u304c\u73fe\u5728\u306e POM \u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ACT_OpenPom=pom.xml \u3092\u958b\u304f

LBL_Problems=\u554f\u984c(&P)\:

LBL_Description=\u8aac\u660e(&D)\:

BTN_Correct=\u4fee\u6b63

ACT_DownloadDeps=\u30e9\u30a4\u30d6\u30e9\u30ea\u3092\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9