<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<!--       
 *        Copyright (C) 2002  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1988).
 *
 *    Sun Microsystems, Inc., 901 San Antonio Road,
 *    Palo Alto, California 94303 U.S.A.
 *
-->
<HTML>
<HEAD>
<META NAME="lastupdated" CONTENT="07feb02">
<TITLE>Legal Notices</TITLE>
</HEAD>
<BODY>
<p>Copyright &copy; 2002 Sun Microsystems, Inc., 901 San Antonio Road, Palo Alto, 
  California 94303, U.S.A. All rights reserved.</p>
<p>Sun Microsystems, Inc. has intellectual property rights relating to technology 
  embodied in the product that is described in this document. In particular, and 
  without limitation, these intellectual property rights may include one or more 
  of the U.S. patents listed at http://www.sun.com/patents and one or more additional 
  patents or pending patent applications in the U.S. and in other countries.</p>
<p>This document and the product to which it pertains are distributed under licenses 
  restricting their use, copying, distribution, and decompilation. No part of 
  the product or of this document may be reproduced in any form by any means without 
  prior written authorization of Sun and its licensors, if any.</p>
<p>Third-party software, including font technology, is copyrighted and licensed 
  from Sun suppliers. </p>
<p>Sun, Sun Microsystems, the Sun logo, Forte, Java, NetBeans, iPlanet, docs.sun.com, 
  and Solaris are trademarks or registered trademarks of Sun Microsystems, Inc. 
  in the U.S. and other countries. </p>
<p>All SPARC trademarks are used under license and are trademarks or registered 
  trademarks of SPARC International, Inc. in the U.S. and other countries. Products 
  bearing SPARC trademarks are based upon architecture developed by Sun Microsystems, 
  Inc.</p>
<p>UNIX is a registered trademark in the United States and other countries, exclusively 
  licensed through X/Open Company, Ltd. </p>
<p>Netscape and Netscape Navigator are trademarks or registered trademarks of 
  Netscape Communications Corporation in the United States and other countries. 
</p>
<p>Federal Acquisitions: Commercial Software - Government Users Subject to Standard 
  License Terms and Conditions.</p>
<p>DOCUMENTATION IS PROVIDED &quot;AS IS&quot; AND ALL EXPRESS OR IMPLIED CONDITIONS, 
  REPRESENTATIONS AND WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, 
  FITNESS FOR FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT, ARE DISCLAIMED, EXCEPT 
  TO THE EXTENT THAT SUCH DISCLAIMERS ARE HELD TO BE LEGALLY INVALID.<br>
</p>
<hr>
<p> Copyright &copy; 2002 Sun Microsystems, Inc., 901 San Antonio Road, Palo Alto, 
  California 94303, Etats-Unis. Tous droits r&eacute;serv&eacute;s.
<p>Sun Microsystems, Inc. a les droits de propri&eacute;t&eacute; intellectuels 
  relatants &agrave; la technologie incorpor&eacute;e dans le produit qui est 
  d&eacute;crit dans ce document. En particulier, et sans la limitation, ces droits 
  de propri&eacute;t&eacute; intellectuels peuvent inclure un ou plus des brevets 
  am&eacute;ricains &eacute;num&eacute;r&eacute;s &agrave; http://www.sun.com/patents 
  et un ou les brevets plus suppl&eacute;mentaires ou les applications de brevet 
  en attente dans les Etats - Unis et dans les autres pays.</p>
<p>Ce produit ou document est prot&eacute;g&eacute; par un copyright et distribu&eacute; 
  avec des licences qui en restreignent l'utilisation, la copie, la distribution, 
  et la d&eacute;compilation. Aucune partie de ce produit ou document ne peut 
  &ecirc;tre reproduite sous aucune forme, parquelque moyen que ce soit, sans 
  l'autorisation pr&eacute;alable et &eacute;crite de Sun et de ses bailleurs 
  de licence, s'il y ena.</p>
<p>Le logiciel d&eacute;tenu par des tiers, et qui comprend la technologie relative 
  aux polices de caract&egrave;res, est prot&eacute;g&eacute; par un copyright 
  et licenci&eacute; par des fournisseurs de Sun. </p>
<p>Sun, Sun Microsystems, le logo Sun, Forte, Java, NetBeans, iPlanet, docs.sun.com, 
  et Solaris sont des marques de fabrique ou des marques d&eacute;pos&eacute;es 
  de Sun Microsystems, Inc. aux Etats-Unis et dans d'autres pays. </p>
<p> Toutes les marques SPARC sont utilis&eacute;es sous licence et sont des marques 
  de fabrique ou des marques d&eacute;pos&eacute;es de SPARC International, Inc. 
  aux Etats-Unis et dans d'autres pays. Les produits protant les marques SPARC 
  sont bas&eacute;s sur une architecture d&eacute;velopp&eacute;e par Sun Microsystems, 
  Inc.</p>
<p>UNIX est une marque enregistree aux Etats-Unis et dans d'autres pays et licenci&eacute;e 
  exclusivement par X/Open Company Ltd. </p>
<p>Netscape et Netscape Navigator sont des marques de Netscape Communications 
  Corporation aux Etats-Unis et dans d'autres pays. </p>
<p>LA DOCUMENTATION EST FOURNIE &quot;EN L'&Eacute;TAT&quot; ET TOUTES AUTRES 
  CONDITIONS, DECLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT 
  EXCLUES, DANS LA MESURE AUTORISEE PAR LA LOI APPLICABLE, Y COMPRIS NOTAMMENT 
  TOUTE GARANTIE IMPLICITE RELATIVE A LA QUALITE MARCHANDE, A L'APTITUDE A UNE 
  UTILISATION PARTICULIERE OU A L'ABSENCE DE CONTREFA&Ccedil;ON.<br>
</p>
</body>
</html>
