<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 2000  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1988).
 *
 *    Sun Microsystems, Inc., 901 San Antonio Road,
 *    Palo Alto, California 94303 U.S.A.
 *
-->
<HTML>
<HEAD>
<TITLE>Legal Notices</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

Copyright 2000 Sun Microsystems, Inc., 901 San Antonio Road, 
Palo Alto, California 94303 U.S.A. All rights reserved. Use is 
subject to license terms. 

<p>
This product or documentation is protected by copyright and 
distributed under licenses restricting its use, copying, distribution, 
and decompilation. No part of this product or documentation may 
be reproduced in any form by any means without prior written 
authorization of Sun and its licensors, if any. Third-party software, 
including font technology, is copyrighted and licensed from Sun 
suppliers.

<p>
Sun, Sun Microsystems, the Sun logo, Java, Jini, Jiro, Forte, NetBeans, 
Solaris, iPlanet, StarOffice, and StarPortal are trademarks or 
registered trademarks of Sun Microsystems, Inc. in the U.S. and other 
countries.

<p>
Federal Acquisitions: Commercial Software--Government Users 
Subject to Standard License Terms and Conditions.

<p>
DOCUMENTATION IS PROVIDED "AS IS" WITHOUT 
WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, 
INCLUDING BUT NOT LIMITED TO, ANY KIND OF IMPLIED OR 
EXPRESS WARRANTY OF NON-INFRINGEMENT OR THE 
IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS 
FOR A PARTICULAR PURPOSE.


<p>
Copyright 2000 Sun Microsystems, Inc., 901 San Antonio Road, 
Palo Alto, Californie 94303 Etats-Unis. Tous droits r&eacute;serv&eacute;s.
Distribu&eacute; par des licences qui en restreignent l'utilisation. 

<p>
Ce produit ou document est prot&eacute;g&eacute; par un copyright et distribu&eacute; 
avec des licences qui en restreignent l'utilisation, la copie, la 
distribution, et la d&eacute;compilation. Aucune partie de ce produit ou 
document ne peut &ecirc;tre reproduite sous aucune forme, par quelque 
moyen que ce soit, sans l'autorisation pr&eacute;alable et &eacute;crite de Sun et de 
ses bailleurs de licence, s'il y en a. Le logiciel d&eacute;tenu par des tiers,
et qui comprend la technologie relative aux polices de caract&egrave;res, est 
prot&eacute;g&eacute; par un copyright et licenci&eacute; par des fournisseurs de Sun.

<p>
Sun, Sun Microsystems, le logo Sun, Java, Jini, Jiro, Forte, NetBeans, 
Solaris, iPlanet, StarOffice, et StarPortal sont des marques de 
fabrique ou des marques d&eacute;pos&eacute;es de Sun Microsystems, Inc. aux 
Etats-Unis et dans d'autres pays. 

<p>
LA DOCUMENTATION EST FOURNIE "EN L'ETAT" ET TOUTES 
AUTRES CONDITIONS, D&Eacute;CLARATIONS ET GARANTIES 
EXPRESSES OU TACITES SONT FORMELLEMENT EXCLUES 
DANS LA MESURE AUTORIS&Eacute;E PAR LA LOI APPLICABLE, Y 
COMPRIS NOTAMMENT TOUTE GARANTIE IMPLICITE 
RELATIVE &Agrave; LA QUALIT&Eacute; MARCHANDE, &Agrave; L'APTITUDE &Agrave; UNE 
UTILISATION PARTICUL&Egrave;RE OU &Agrave; L'ABSENCE DE 
CONTREFA&Ccedil;ON.

 

</body>
</html>
