
#
# The contents of this file are subject to the terms of the Common Development
# and Distribution License (the License). You may not use this file except in
# compliance with the License.
# 
# You can obtain a copy of the License at http://www.netbeans.org/cddl.html
# or http://www.netbeans.org/cddl.txt.
# 
# When distributing Covered Code, include this CDDL Header Notice in each file
# and include the License file at http://www.netbeans.org/cddl.txt.
# If applicable, add the following below the CDDL Header, with the fields
# enclosed by brackets [] replaced by your own identifying information:
# "Portions Copyrighted [year] [name of copyright owner]"
# 
# The Original Software is NetBeans. The Initial Developer of the Original
# Software is Sun Microsystems, Inc. Portions Copyright 1997-2007 Sun
# Microsystems, Inc. All Rights Reserved.
#

OpenIDE-Module-Name=LDAP WSDL \u62e1\u5f35
OpenIDE-Module-Short-Description=WSDL \u30a8\u30c7\u30a3\u30bf\u7528\u306e LDAP \u62e1\u5f35\u3002
OpenIDE-Module-Long-Description=\u3053\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f\u3001LDAP \u30b9\u30ad\u30fc\u30de\u3092\u63d0\u4f9b\u3057\u3001WSDL \u30a8\u30c7\u30a3\u30bf\u306b\u63a5\u7d9a\u3057\u307e\u3059\u3002
OpenIDE-Module-Display-Category=SOA
Services/MIMEResolver/LdifResolver.xml=LDIF \u30d5\u30a1\u30a4\u30eb
Services/MIMEResolver/LResolver.xml=L \u30d5\u30a1\u30a4\u30eb
Templates/SOA_BPEL=SOA
Templates/ESB=ESB
Templates/ESB/LTemplate.ldif=\u7a7a\u306e LDIF \u30d5\u30a1\u30a4\u30eb
Templates/ESB/serverBrowser=LDAP \u30b5\u30fc\u30d0\u30fc\u306e WSDL...
WSDLEditor/Binding/LDAPBinding= LDAP \u7d50\u5408
WSDLEditor/BindingOperation/LDAPBindingOperation= LDAP \u64cd\u4f5c
WSDLEditor/BindingOperationInput/LDAPBindingOperationInput= LDAP \u5165\u529b\u64cd\u4f5c
WSDLEditor/BindingOperationOutput/LDAPBindingOperationOutput= LDAP \u51fa\u529b\u64cd\u4f5c
WSDLEditor/ServicePort/LDAPServicePort=LDAP \u30a2\u30c9\u30ec\u30b9
DESC_Element_binding=\u300c\u7d50\u5408\u300d\u306f\u3001LDAP \u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u57fa\u3065\u304f\u7d50\u5408\u3092\u793a\u3057\u3066\u3044\u307e\u3059\u3002
DESC_ComplexType_tOperation=\u300c\u64cd\u4f5c\u300d\u306f\u3001LDAP \u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u57fa\u3065\u304f\u7d50\u5408\u64cd\u4f5c\u306e\u8a73\u7d30\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
DESC_Attribute_type=LDAP \u64cd\u4f5c\u306e\u30bf\u30a4\u30d7\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002\u6709\u52b9\u306a\u5024\u306f Search \u3067\u3059
DESC_Element_input=\u300c\u5165\u529b\u300d\u306f\u3001LDAP \u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u57fa\u3065\u304f\u5165\u529b\u64cd\u4f5c\u306e\u7d50\u5408\u306e\u8a73\u7d30\u3092\u5b9a\u7fa9\u3057\u307e\u3059
DESC_Element_output=\u300c\u51fa\u529b\u300d\u306f\u3001LDAP \u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u57fa\u3065\u304f\u51fa\u529b\u64cd\u4f5c\u306e\u7d50\u5408\u306e\u8a73\u7d30\u3092\u5b9a\u7fa9\u3057\u307e\u3059
DESC_Attribute_returnPartName=\u8fd4\u3055\u308c\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u30d1\u30fc\u30c8\u540d\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002Search \u64cd\u4f5c\u3067\u4f7f\u7528\u3055\u308c\u307e\u3057\u305f\u3002
DESC_Attribute_attributes=\u53d6\u5f97\u3055\u308c\u308b\u5c5e\u6027\u306e\u30ea\u30b9\u30c8\u3092\u5b9a\u7fa9\u3057\u307e\u3059
DESC_Element_address=\u300c\u30a2\u30c9\u30ec\u30b9\u300d\u306f\u3001LDAP \u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u57fa\u3065\u304f\u30b5\u30fc\u30d3\u30b9\u306e\u30a2\u30c9\u30ec\u30b9\u3092\u793a\u3057\u307e\u3059\u3002
DESC_Attribute_location=LDAP \u30b5\u30fc\u30d0\u30fc\u306e URL \u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002ldap \u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u542b\u3080\u6709\u52b9\u306a URL\u3002\u4f8b: ldap:<IP \u30a2\u30c9\u30ec\u30b9>:<\u30dd\u30fc\u30c8>
DESC_PROTOCOL_PROPERTY=\u30e6\u30fc\u30b6\u30fc\u304c SSL \u3068\u30d7\u30ec\u30fc\u30f3\u306e\u3069\u3061\u3089\u3092\u4f7f\u7528\u3059\u308b\u304b\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u300c\u306a\u3057\u300d\u3067\u3059\u3002
DESC_PRINCIPAL_PROPERTY=\u533f\u540d\u30ed\u30b0\u30a4\u30f3 (\u8a8d\u8a3c = \u306a\u3057) \u4ee5\u5916\u306e\u8a8d\u8a3c\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u4f7f\u7528\u3059\u308b\u3068\u304d\u306b\u5fc5\u8981\u306a\u4e3b\u4f53\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u30e6\u30fc\u30b6\u30fc\u306e\u5b8c\u5168\u4fee\u98fe\u8b58\u5225\u540d (DN)\u3002\u4f8b: CN=Administrator,CN=Users,DC=stc,dc=com
DESC_CREDENTIAL_PROPERTY=\u533f\u540d\u30ed\u30b0\u30a4\u30f3 (\u8a8d\u8a3c = \u306a\u3057) \u4ee5\u5916\u306e\u8a8d\u8a3c\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u4f7f\u7528\u3059\u308b\u3068\u304d\u306b\u5fc5\u8981\u306a\u8cc7\u683c\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002
DESC_SSL_TYPE=\u4f7f\u7528\u3059\u308b SSL \u63a5\u7d9a\u306e\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u300c\u306a\u3057\u300d\u3001\u300cSSL \u306e\u6709\u52b9\u5316\u300d\u3001\u307e\u305f\u306f\u300cTLS \u30aa\u30f3\u30c7\u30de\u30f3\u30c9\u300d\u3092\u9078\u629e\u3057\u307e\u3059\u3002\u6b21\u306e\u3088\u3046\u306b\u3057\u3066\u5fc5\u8981\u306a\u5024\u3092\u5165\u529b\u3057\u307e\u3059\u3002\u300c\u306a\u3057\u300d: SSL \u306a\u3057 (\u7c21\u5358\u306a\u30d7\u30ec\u30fc\u30f3\u63a5\u7d9a)\u3002\u300cSSL \u306e\u6709\u52b9\u5316\u300d: SSL \u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002LDAP \u30b5\u30fc\u30d0\u30fc\u3068\u306e\u3059\u3079\u3066\u306e\u901a\u4fe1\u3067\u3001\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4fdd\u8b77\u3055\u308c\u305f\u901a\u4fe1\u30c1\u30e3\u30cd\u30eb\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u6ce8: \u300cSSL \u306e\u6709\u52b9\u5316\u300d\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u300c\u30d7\u30ed\u30d0\u30a4\u30c0 URL\u300d\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u3001\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4fdd\u8b77\u3055\u308c\u305f LDAP \u30dd\u30fc\u30c8 (\u30c7\u30d5\u30a9\u30eb\u30c8\u306f 636) \u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
DESC_AUTHENTICATION=\u4f7f\u7528\u3059\u308b\u8a8d\u8a3c (\u300c\u306a\u3057\u300d\u307e\u305f\u306f\u300c\u30b7\u30f3\u30d7\u30eb\u300d) \u3092\u9078\u629e\u3067\u304d\u307e\u3059\u3002\u6b21\u306e\u3088\u3046\u306b\u3057\u3066\u5fc5\u8981\u306a\u8a8d\u8a3c\u3092\u9078\u629e\u3057\u307e\u3059\u3002 
DESC_TRUSTSTORE=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u3053\u306e\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u306f\u3001SSL \u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u3068\u304d\u306e CA \u8a3c\u660e\u66f8\u306e\u7ba1\u7406\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
DESC_TRUSTSTORE_TYPE=SSL \u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u3068\u304d\u306e CA \u8a3c\u660e\u66f8\u306e\u7ba1\u7406\u306b\u4f7f\u7528\u3059\u308b\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u306e\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u304c\u6307\u5b9a\u3055\u308c\u306a\u304b\u3063\u305f\u5834\u5408\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u3067\u3042\u308b JKS \u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
DESC_TRUSTSTORE_PASSWORD=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u3001SSL \u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u3068\u304d\u306e CA \u8a3c\u660e\u66f8\u306e\u7ba1\u7406\u306b\u4f7f\u7528\u3059\u308b\u30c8\u30e9\u30b9\u30c8\u30b9\u30c8\u30a2\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306e\u3082\u306e\u3067\u3059\u3002
DESC_KEYSTORE=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ad\u30fc\u30b9\u30c8\u30a2\u30d5\u30a1\u30a4\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u3053\u306e\u30ad\u30fc\u30b9\u30c8\u30a2\u306f\u3001SSL \u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u3068\u304d\u306e\u9375/\u8a3c\u660e\u66f8\u306e\u7ba1\u7406\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
DESC_KEYSTORETYPE=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ad\u30fc\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002\u3053\u306e\u30ad\u30fc\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u306f\u3001SSL \u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u3068\u304d\u306e\u9375/\u8a3c\u660e\u66f8\u306e\u7ba1\u7406\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u30ad\u30fc\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u304c\u6307\u5b9a\u3055\u308c\u306a\u304b\u3063\u305f\u5834\u5408\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ad\u30fc\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u3067\u3042\u308b JKS \u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
DESC_KEYSTORE_USERNAME=SSL \u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u3068\u304d\u306e\u9375/\u8a3c\u660e\u66f8\u306e\u7ba1\u7406\u306b\u4f7f\u7528\u3059\u308b\u30ad\u30fc\u30b9\u30c8\u30a2\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u3002\u6ce8: \u30ad\u30fc\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u304c PKCS12 \u307e\u305f\u306f JKS \u306e\u5834\u5408\u306f\u3001\u300c\u30ad\u30fc\u30b9\u30c8\u30a2\u306e\u30e6\u30fc\u30b6\u30fc\u540d\u300d\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u4f7f\u7528\u3055\u308c\u307e\u305b\u3093\u3002PKCS12 \u304a\u3088\u3073 JKS \u30ad\u30fc\u30b9\u30c8\u30a2\u30bf\u30a4\u30d7\u3067\u306f\u3001\u30a2\u30af\u30bb\u30b9\u7528\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u304c\u3001\u30e6\u30fc\u30b6\u30fc\u540d\u306f\u5fc5\u8981\u3042\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5024\u3092\u5165\u529b\u3057\u3066\u3082\u3001PKCS12 \u304a\u3088\u3073 JKS \u3067\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002DESC_KEYSTORE_PASSWORD=\u30ad\u30fc\u30b9\u30c8\u30a2\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5b9a\u7fa9\u3057\u307e\u3059 DESC_OPERATIONTYPE=\u64cd\u4f5c\u3092\u5b9a\u7fa9\u3057\u307e\u3059 
DESC_RETURN_PARTNAME=\u30d1\u30fc\u30c8\u540d\u3092\u5b9a\u7fa9\u3057\u307e\u3059 
DESC_KEYSTORE_PASSWORD=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30ad\u30fc\u30b9\u30c8\u30a2\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u3053\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u3001SSL \u63a5\u7d9a\u3092\u78ba\u7acb\u3059\u308b\u3068\u304d\u306e\u9375/\u8a3c\u660e\u66f8\u306e\u7ba1\u7406\u306b\u4f7f\u7528\u3059\u308b\u30ad\u30fc\u30b9\u30c8\u30a2\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002\u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3042\u308a\u307e\u305b\u3093\u3002
DESC_ATTRIBUTES=\u5c5e\u6027\u3092\u5b9a\u7fa9\u3057\u307e\u3059