<!--
                Sun Public License Notice

The contents of this file are subject to the Sun Public License
Version 1.0 (the "License"). You may not use this file except in
compliance with the License. A copy of the License is available at
http://www.sun.com/

The Original Code is NetBeans. The Initial Developer of the Original
Code is Sun Microsystems, Inc. Portions Copyright 1997-2001 Sun
Microsystems, Inc. All Rights Reserved.
-->

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<!--       
 *        Copyright (C) 1999  Sun Microsystems, Inc
 *                    All rights reserved.
 *          Notice of copyright on this source code 
 *          product does not indicate publication. 
 * 
 * RESTRICTED RIGHTS LEGEND: Use, duplication, or disclosure by 
 * the U.S. Government is subject to restrictions as set forth 
 * in subparagraph (c)(1)(ii) of the Rights in Technical Data
 * and Computer Software Clause at DFARS 252.227-7013 (Oct. 1988) 
 * and FAR 52.227-19 (c) (June 1988).
 *
 *    Sun Microsystems, Inc., 901 San Antonio Road,
 *    Palo Alto, California 94303 U.S.A.
 *
-->
<HTML>
<HEAD>
<TITLE>Legal Notices</TITLE>
</HEAD>
<BODY BGCOLOR="ffffff">

Copyright 1999 Sun Microsystems, Inc., 901 San Antonio Road, Palo
Alto, California 94303 U.S.A. All rights reserved.  

<p>
This product or documentation is protected by copyright and
distributed under licenses restricting its use, copying, distribution,
and decompilation. No part of this product or documentation may be
reproduced in any form by any means without prior written
authorization of Sun and its licensors, if any. Third-party software,
including font technology, is copyrighted and licensed from Sun
suppliers.

<p> Sun, Sun Microsystems, the Sun logo, and Java[ATTRIBUTION OF ALL
OTHER SUN AND THIRD-PARTY TRADEMARKS INCLUDED IN TMARK AND MENTIONED
IN PRODUCT OR DOCUMENTATION. DO NOT LEAVE THIS TEXT IN YOUR DOCUMENT!]
are trademarks or registered trademarks of Sun Microsystems, Inc. in
the U.S. and other countries.

<p>
The OPEN LOOK and Sun<sup><font size="-2">TM</font></sup> Graphical
User Interface was developed by Sun Microsystems, Inc. for its users
and licensees. Sun acknowledges the pioneering efforts of Xerox in
researching and developing the concept of visual or graphical user
interfaces for the computer industry. Sun holds a non-exclusive
license from Xerox to the Xerox Graphical User Interface, which
license also covers SunOS licensees who implement OPEN LOOK GUIs and
otherwise comply with SunOS written license agreements.

<p> U.S. Government approval required when exporting the product.

<p>
DOCUMENTATION IS PROVIDED "AS IS" WITHOUT WARRANTY OF ANY KIND, EITHER
EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO, ANY KIND OF IMPLIED
OR EXPRESS WARRANTY OF NON-INFRINGEMENT OR THE IMPLIED WARRANTIES OF
MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.

<hr> 
<p> 
Copyright 1999 Sun Microsystems, Inc., 901 San Antonio Road,
Palo Alto, Californie 94303 Etats-Unis. Tous droits r&eacute;serv&eacute;s.  

<p> 
Ce produit ou document est prot&eacute;g&eacute; par un copyright et distribu&eacute; avec
des licences qui en restreignent l'utilisation, la copie, la
distribution, et la d&eacute;compilation. Aucune partie de ce produit ou
document ne peut &ecirc;tre reproduite sous aucune forme, par quelque moyen
que ce soit, sans l'autorisation pr&eacute;alable et &eacute;crite de Sun et de ses
bailleurs de licence, s'il y en a. Le logiciel d&eacute;tenu par des tiers,
et qui comprend la technologie relative aux polices de caract&egrave;res, est
prot&eacute;g&eacute; par un copyright et licenci&eacute; par des fournisseurs de Sun.

<p>
Sun, Sun Microsystems, le logo Sun, et Java[ATTRIBUTION OF ALL OTHER
SUN AND THIRD-PARTY TRADEMARKS INCLUDED IN TMARK AND MENTIONED IN
PRODUCT OR DOCUMENTATION. DO NOT LEAVE THIS TEXT IN YOUR DOCUMENT!]
sont des marques de fabrique ou des marques d&eacute;pos&eacute;es de Sun
Microsystems, Inc. aux Etats-Unis et dans d'autres pays.

<p> 
L'interface d'utilisation graphique OPEN LOOK et Sun<sup><font size="-2">TM</font></sup> a &eacute;t&eacute;
d&eacute;velopp&eacute;e par Sun Microsystems, Inc. pour ses utilisateurs et
licenci&eacute;s. Sun reconna&icirc;t les efforts de pionniers de Xerox pour la
recherche et le d&eacute;veloppement du concept des interfaces d'utilisation
visuelle ou graphique pour l'industrie de l'informatique. Sun d&eacute;tient
une licence non exclusive de Xerox sur l'interface d'utilisation
graphique Xerox, cette licence couvrant &eacute;galement les licenci&eacute;s de Sun
qui mettent en place l'interface d'utilisation graphique OPEN LOOK et
qui en outre se conforment aux licences &eacute;crites de Sun. L'accord du
gouvernement am&eacute;ricain est requis avant l'exportation du produit.

<p>
LA DOCUMENTATION EST FOURNIE "EN L'ETAT" ET TOUTES AUTRES CONDITIONS,
D&Eacute;CLARATIONS ET GARANTIES EXPRESSES OU TACITES SONT FORMELLEMENT
EXCLUES DANS LA MESURE AUTORIS&Eacute;E PAR LA LOI APPLICABLE, Y COMPRIS
NOTAMMENT TOUTE GARANTIE IMPLICITE RELATIVE &Agrave; LA QUALIT&Eacute; MARCHANDE, &Agrave;
L'APTITUDE &Agrave; UNE UTILISATION PARTICUL&Egrave;RE OU &Agrave; L'ABSENCE DE
CONTREFA&Ccedil;ON.
 

  </body>
</html>
